УТ_для_edt/src/DataProcessors/смартIECHOЗагрузкаКомплектующихИзExcel/смартIECHOЗагрузкаКомплектующихИзExcel.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>смартIECHOЗагрузкаКомплектующихИзExcel</name>
  <comment>//смарт:ММ #092 389 06.01.2021</comment>
  <attributes>
    <name>АдресФайлаВоВременномХранилище</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗагружаемыеДанные</name>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комплектующая</name>
      <type>
        <types>CatalogRef.смартIECHOКомплектующие</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеИзФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоГруппа</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УТ_для_edt/src/Catalogs/смартIECHOКомплектующие/смартIECHOКомплектующие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартIECHOКомплектующие</name>
  <comment>//смарт:ММ #092 389 06.01.2021</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>УточнениеВНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьУточнениеВСпецификации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Важно</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.смартIECHOКомплектующиеПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяКомплектующая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничениеИспользованияПоМоделям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Model</name>
    <type>
      <types>EnumRef.смартIECHOМоделиКомплектующих</types>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <comment>Тип модели на английском</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничениеИспользованияПоРазмеру</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентРасчетаСебестоимости</name>
    <comment>// 16.05.2021</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеАнгл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючеваяКомплектующая</name>
    <comment>//++ #Б1252 смарт: Шляпников 12.11.2024 / Создание Заказа клиента из Спецификации IECHO</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КабельВКомплекте</name>
    <comment>//++ #Б1252 смарт: Шляпников 12.11.2024 / Создание Заказа клиента из Спецификации IECHO</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МоделиДляИспользования</name>
    <attributes>
      <name>Модель</name>
      <type>
        <types>EnumRef.смартIECHOМоделиКомплектующих</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазмерыДляИспользования</name>
    <attributes>
      <name>Размер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/DataProcessors/смартIECHOЗагрузкаКомплектующихИзExcel/Forms/Форма/Module.bsl
///////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ И ЭЛЕМЕНТОВ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	
	Если Объект.ЗагружаемыеДанные.Количество() > 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗаполнениемТабличнойЧастиЗавершение", ЭтотОбъект, );
		ТекстВопроса = НСтр("ru = 'Перед заполнением табличная часть будет очищена. Заполнить?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		
	Иначе
		
		ПрочитатьФайлКлиент();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗаполнениемТабличнойЧастиЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда	
		
		ПрочитатьФайлКлиент();		
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	
	Если Объект.ЗагружаемыеДанные.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для записи");
		Возврат;
	КонецЕсли;
		
	ВыполнитьОбработкуНаСервере();
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область ЧтениеФайла

&НаКлиенте
Процедура ПрочитатьФайлКлиент()
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.ПроверятьСуществованиеФайла = Истина;
	
	//ДиалогВыбора.Фильтр = "Файл Excel (*.xls,*.xlsx)|*.xls*";
	ДиалогВыбора.Фильтр = "Файл Excel (*.xlsx)|*.xlsx";
	ДиалогВыбора.Заголовок 					= "Выбор Excel-файла";
	ДиалогВыбора.ПредварительныйПросмотр	= Ложь;
	
	РезультатВыбора = ДиалогВыбора.Выбрать();
	
	ПутьКФайлу = "";
	
	Если РезультатВыбора Тогда
		
		ПутьКФайлу = СокрЛП(ДиалогВыбора.ПолноеИмяФайла);
		Если Прав(ВРЕГ(ПутьКФайлу), 3) = "XLS" Тогда
			РасширениеФайла = "xls";
		Иначе
			РасширениеФайла = "xlsx";
		КонецЕсли;
		
		ЗагрузитьДанныеИзФайлаКлиент(ПутьКФайлу);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзФайлаКлиент(ПутьКФайлу)
	
	Отказ = ПереместитьФайлНаСервер(ПутьКФайлу);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	АдресФайла = Объект.АдресФайлаВоВременномХранилище;
		
	Если НЕ ЗначениеЗаполнено(АдресФайла) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("ru = 'Не удалось получить данные для загрузки - не найден файл'"));
		Возврат;
	КонецЕсли;	
	
	ЗагрузитьСервер(АдресФайла);

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСервер(АдресФайла)
	
	ТЧ = Объект.ЗагружаемыеДанные;
	
	ТЧ.Очистить();
		
	//ТЗ = ЗагрузитьМетодом_1C836(АдресФайла); // Считать весь файл.
	НомерПервойСтроки = 2;
	ТЗ = ЗагрузитьМетодом_EXCEL1C(АдресФайла, , НомерПервойСтроки-1, НомерПервойСтроки);
	
	Попытка
		
		ТекСтрока = 1;
		
		КоличествоПустыхСтрокПодряд = 0;
		
		Пока ТекСтрока <= ТЗ.Количество()-1 Цикл
			
			МассивСтроки = ПолучитьНаборДанныхИзТЗ(ТЗ[ТекСтрока], ТЗ.Колонки.Количество() - 2);
			КоличествоКолонок = МассивСтроки.Количество();
			
			Колонка1 = СокрЛП(МассивСтроки[1]);
			Колонка2 = СокрЛП(МассивСтроки[2]);
			 
			Если ЗначениеЗаполнено(Колонка2) И ЗначениеЗаполнено(Колонка1) Тогда
				НоваяСтрока = ТЧ.Добавить();
				НоваяСтрока.Порядок = ТекСтрока;
				НоваяСтрока.НаименованиеИзФайла	= Колонка1;
				НоваяСтрока.Цена = Колонка2;
				КоличествоПустыхСтрокПодряд = 0;
			ИначеЕсли ЗначениеЗаполнено(Колонка1) Тогда
				НоваяСтрока = ТЧ.Добавить();
				НоваяСтрока.Порядок = ТекСтрока;
				НоваяСтрока.НаименованиеИзФайла	= Колонка1;
				НоваяСтрока.ЭтоГруппа = Истина;
				КоличествоПустыхСтрокПодряд = 0;
			ИначеЕсли НЕ ЗначениеЗаполнено(Колонка1) Тогда
				КоличествоПустыхСтрокПодряд = КоличествоПустыхСтрокПодряд + 1;
				Если КоличествоПустыхСтрокПодряд > 1 Тогда
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
			ТекСтрока = ТекСтрока + 1;
		КонецЦикла;
				
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("ошибка на строке " + (ТекСтрока + 1) + ". " + ОписаниеОшибки());
	КонецПопытки;
		
	Если ТЧ.Количество() > 0 Тогда
		ДозаполнитьТаблицу();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДозаполнитьТаблицу()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ.Порядок КАК Порядок,
	|	ВТ.НаименованиеИзФайла КАК НаименованиеИзФайла,
	|	ВТ.Цена,
	|	ВТ.ЭтоГруппа
	|ПОМЕСТИТЬ ВТ_Файл
	|ИЗ
	|	&ВТ КАК ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Файл.Порядок КАК Порядок,
	|	ВТ_Файл.НаименованиеИзФайла КАК НаименованиеИзФайла,
	|	ВТ_Файл.Цена,
	|	ВТ_Файл.ЭтоГруппа,
	|	ЕСТЬNULL(смартIECHOКомплектующие.Ссылка, ЗНАЧЕНИЕ(Справочник.смартIECHOКомплектующие.ПустаяСсылка)) КАК Комплектующая
	|ИЗ
	|	ВТ_Файл КАК ВТ_Файл
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.смартIECHOКомплектующие КАК смартIECHOКомплектующие
	|		ПО ВТ_Файл.НаименованиеИзФайла = смартIECHOКомплектующие.Наименование
	|		И ВТ_Файл.ЭтоГруппа = смартIECHOКомплектующие.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	Запрос.УстановитьПараметр("ВТ", Объект.ЗагружаемыеДанные.Выгрузить());
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	Объект.ЗагружаемыеДанные.Загрузить(ТЗ);
						
КонецПроцедуры

&НаСервере
Функция ПолучитьНаборДанныхИзТЗ(СтрокаТЗ, КолвоКолонок)
	
	//Прочитаем данные из строки в массив данных
	МассивСтроки = Новый Массив;
	МассивСтроки.Добавить(""); //1 Индекс с 0, поэтому будет там пусто, чтобы не путаться в показаниях
	ТекКолонка = 1;
	Пока ТекКолонка <= КолвоКолонок Цикл
		ЗначениеЯчейки = СтрокаТЗ["N"+ТекКолонка];
		МассивСтроки.Добавить(ЗначениеЯчейки);
		ТекКолонка = ТекКолонка + 1;
	КонецЦикла;
	Возврат МассивСтроки;
	
КонецФункции

&НаСервере
Функция ЗагрузитьМетодом_EXCEL1C(Знач АдресФайла, Знач ИмяЛиста = "", Знач СтрокаЗаголовка = 1, НачСтрока = 0, КонСтрока = 0, КолвоСтрокФайла = 0)
	
	Перем ТабличныйДокумент, ОбластьФайла, КолВоКолонокФайла, ИмяКолонки, Область, ТекущаяОбласть, нСтрока, нКолонка, НоваяСтрокаТФ, ЗначениеЯчейки;
	Перем ТаблицаРезультат;
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
	ИмяВременногоФайлаXLSX = ПолучитьИмяВременногоФайла(РасширениеФайла); 
	ДвоичныеДанные.Записать(ИмяВременногоФайлаXLSX);

	ТабличныйДокумент = Новый ТабличныйДокумент;
	Попытка
		// Выполняется долго на больших файлах.
		ТабличныйДокумент.Прочитать(ИмяВременногоФайлаXLSX, СпособЧтенияЗначенийТабличногоДокумента.Значение);    // СпособЧтенияЗначенийТабличногоДокумента - новый параметр платформы 8.3.6. Второе значение "Текст".
	Исключение
		Сообщить(ОписаниеОшибки(), СтатусСообщения.Внимание);
		Возврат Новый ТаблицаЗначений;
	КонецПопытки;
	
	ОбластьФайла = ТабличныйДокумент;
	//Если ВерсияПриложенияМеньше8310() Тогда
	//	// Платформа 8.3.9 и более ранние (Файл EXCEL как 1 лист).
	//	КолвоСтрокФайла = ОбластьФайла.ВысотаТаблицы;
	//	КолВоКолонокФайла = ОбластьФайла.ШиринаТаблицы;
	//Иначе
		// Платформа 8.3.10 (Облать = Лист данных).
		
	Обл = ТабличныйДокумент.Области[0];
	ИмяЛиста = Обл.Имя;
	
	Если ТабличныйДокумент.Области.Найти(ИмяЛиста) = Неопределено Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
		ОбластьФайла = ТабличныйДокумент.ПолучитьОбласть(ИмяЛиста);
		КолВоСтрокФайла = ОбластьФайла.ПолучитьРазмерОбластиДанныхПоВертикали();
		КолВоКолонокФайла = ОбластьФайла.ПолучитьРазмерОбластиДанныхПоГоризонтали();
	//КонецЕсли;
	
	// Проверка заполненности листа.
	Если КолвоСтрокФайла = 0 Тогда
		// Завершение работы.
		// Закрытие Объектов.
		ТабличныйДокумент = Неопределено;
		Возврат Новый ТаблицаЗначений;    // В случае ошибки возвращаем пустую таблицу значений.
	КонецЕсли;
	
	// Создание результирующей таблицы, в которую будут записываться считанные из файла данные.
	ТаблицаРезультат = Новый ТаблицаЗначений;
	
	// Формирование колонок результирующей таблицы.
	
	// "НомерСтроки" - для наглядности и удобства.
	// В зависимости от разрабатываемой обработки.
	// "Сопоставлено" - может быть другим.
	// Здесь же могут быть добавлены другие колонки, не формируемые из содержимого файла.
	ТаблицаРезультат.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"), "№", 4);
	ТаблицаРезультат.Колонки.Добавить("Сопоставлено", Новый ОписаниеТипов("Булево"), "Сопоставлено", 1);
	
	Для ит = 1 ПО КолВоКолонокФайла Цикл
		нКолонка = СтрЗаменить(ит, Символы.НПП, "");
		ИмяКолонки = "N" + нКолонка;
		ТаблицаРезультат.Колонки.Добавить(ИмяКолонки);
	КонецЦикла;
	
	// 1-я строка. Заголовки.
	НоваяСтрокаТФ = ТаблицаРезультат.Добавить();
	НоваяСтрокаТФ.НомерСтроки = 1;
	Для ит=1 ПО КолВоКолонокФайла Цикл
		нКолонка = СтрЗаменить(ит, Символы.НПП, "");
		ИмяКолонки = "N" + нКолонка;
		НоваяСтрокаТФ[ИмяКолонки] = ОбластьФайла.ПолучитьОбласть("R1" + "C"+нКолонка).ТекущаяОбласть.Текст;
		
		// Используется при формировании таблицы на форме обработки.
		ШиринаКолонки = ТаблицаРезультат.Колонки[ИмяКолонки].Ширина;
		ДлинаСтроки    = СтрДлина(СокрЛП(НоваяСтрокаТФ[ИмяКолонки]));
		ТаблицаРезультат.Колонки[ИмяКолонки].Ширина = ?(ШиринаКолонки < ДлинаСтроки, ДлинаСтроки, ШиринаКолонки);
	КонецЦикла;
	
	НачСтрока = ?(НачСтрока = 0, 2, НачСтрока);
	КонСтрока = ?(КонСтрока = 0, КолвоСтрокФайла, КонСтрока);
	
	Для нСтрокаТФ = НачСтрока ПО КонСтрока Цикл
		НоваяСтрокаТФ = ТаблицаРезультат.Добавить();
		НоваяСтрокаТФ[0] = нСтрокаТФ;
		нСтрока = СтрЗаменить(нСтрокаТФ, Символы.НПП, "");
		Для нКолонкаТФ = 1 ПО КолВоКолонокФайла Цикл
			нКолонка = СтрЗаменить(нКолонкаТФ, Символы.НПП, "");
			Область = ОбластьФайла.ПолучитьОбласть("R"+нСтрока+"C"+нКолонка);
			ТекущаяОбласть = Область.ТекущаяОбласть;
			
			Если ТекущаяОбласть.СодержитЗначение Тогда 
				ЗначениеЯчейки = ТекущаяОбласть.Значение;        // Число, Дата.
			Иначе
				ЗначениеЯчейки = СокрЛП(ТекущаяОбласть.Текст);    // Строка, Булево. (Булево как строка "ИСТИНА"/"ЛОЖЬ")
				Если ЗначениеЗаполнено(ЗначениеЯчейки) Тогда
					ЗначениеЯчейки = ПреобразоватьПростоеЗначениеИзСтрокиВТипизованноеЗначение1С(ЗначениеЯчейки);
					Если ТипЗнч(ЗначениеЯчейки) = Тип("Строка") Тогда
						ЗначениеЯчейки = СокрЛП(ЗначениеЯчейки);
						
						// Обработка частного случая
						ЗначениеЯчейки = СтрЗаменить(ЗначениеЯчейки, "_x0000_", "");
						
					КонецЕсли;
					
					// Обработка частного случая
					Если нКолонка = "8" Тогда
						ЗначениеЯчейки = СтрЗаменить(Строка(ЗначениеЯчейки), Символы.НПП, "");
					КонецЕсли;
						
				Иначе
					ЗначениеЯчейки = Неопределено;
					Если Область.Рисунки.Количество() > 0 Тогда    // Изображение.
						ЗначениеЯчейки = ПолучитьЗначениеЯчейкиОбластиТабличногоДокументаСКартинками(Область, нСтрока, нКолонка, "УИД");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			ИмяКолонки = "N" + нКолонка;
			НоваяСтрокаТФ[ИмяКолонки] = ЗначениеЯчейки;
			
			// Используется при формировании таблицы на форме обработки.
			ШиринаКолонки = ТаблицаРезультат.Колонки[ИмяКолонки].Ширина;
			ДлинаСтроки    = СтрДлина(СокрЛП(НоваяСтрокаТФ[ИмяКолонки]));
			ТаблицаРезультат.Колонки[ИмяКолонки].Ширина = ?(ШиринаКолонки < ДлинаСтроки, ДлинаСтроки, ШиринаКолонки);
		КонецЦикла;
	КонецЦикла;
	
	// Юзабилити. Удалить пустые колонки.
	//УдалитьКолонкиСНулевойШириной(ТаблицаРезультат);
	
	Возврат ТаблицаРезультат;
	
КонецФункции

&НаСервере
Процедура УдалитьКолонкиСНулевойШириной(ТаблицаРезультат)
	//Перем МассивПустыхКолонок;
	//
	//// Найдем пустые колонки.
	//МассивПустыхКолонок = Новый Массив;
	//Для Каждого Колонка ИЗ ТаблицаРезультат.Колонки Цикл
	//	Если Колонка.Ширина = 0 Тогда
	//		МассивПустыхКолонок.Добавить(Колонка.Имя);
	//	КонецЕсли;
	//КонецЦикла;
	//
	//// Удалим пустые колонки.
	//Для Каждого ПустаяКолонка ИЗ МассивПустыхКолонок Цикл
	//	ТаблицаРезультат.Колонки.Удалить(ПустаяКолонка);
	//КонецЦикла;
	
КонецПроцедуры


&НаСервере
Функция ПреобразоватьПростоеЗначениеИзСтрокиВТипизованноеЗначение1С(Знач ИсходноеЗначение)
	
	Если НЕ ИсходноеЗначение = "" Тогда
		Если ТолькоЦифрыИЗапятаяВСтроке(ИсходноеЗначение, Истина, Ложь) Тогда
			Попытка
				Возврат Число(ИсходноеЗначение);
			Исключение
				Возврат ИсходноеЗначение
			КонецПопытки;
		Иначе
			Если ВРег(ИсходноеЗначение) = "ИСТИНА" ИЛИ ВРег(ИсходноеЗначение) = ("ИСТИНА"+Символы.ПС) ИЛИ ВРег(ИсходноеЗначение) = "TRUE" ИЛИ ВРег(ИсходноеЗначение) = ("TRUE"+Символы.ПС) Тогда
				Возврат Истина;
			ИначеЕсли ВРег(ИсходноеЗначение) = "ЛОЖЬ" ИЛИ  ВРег(ИсходноеЗначение) = ("ЛОЖЬ"+Символы.ПС) ИЛИ ВРег(ИсходноеЗначение) = "FALSE" ИЛИ ВРег(ИсходноеЗначение) = ("FALSE"+Символы.ПС) Тогда
				Возврат Ложь;
			Иначе
				Возврат ПреобразоватьИзСтрокиВДату(ИсходноеЗначение);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ИсходноеЗначение
	
КонецФункции

// Проверяет, содержит ли строка только цифры и запятую.
//
// Параметры:
//  СтрокаПроверки          - Строка - Строка для проверки
//  УчитыватьЛидирующиеНули - Булево - Флаг учета лидирующих нулей, если Истина, то ведущие нули пропускаются
//  УчитыватьПробелы        - Булево - Флаг учета пробелов, если Истина, то пробелы при проверке игнорируются
//
// Возвращаемое значение:
//   Булево - Истина - строка содержит только цифры или пустая, Ложь - строка содержит иные символы.
//
&НаСервере
Функция ТолькоЦифрыИЗапятаяВСтроке(Знач СтрокаПроверки, Знач УчитыватьЛидирующиеНули = Истина, Знач УчитыватьПробелы = Истина)
	
	Если ТипЗнч(СтрокаПроверки) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ УчитыватьПробелы Тогда
		СтрокаПроверки = СтрЗаменить(СтрокаПроверки, " ", "");
	КонецЕсли;
	
	Если Сред(СтрокаПроверки, 1, 1) = "-" Тогда
		СтрокаПроверки = Сред(СтрокаПроверки, 2, СтрДлина(СтрокаПроверки));
	КонецЕсли;
	
	Если ПустаяСтрока(СтрокаПроверки) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если НЕ УчитыватьЛидирующиеНули Тогда
		Позиция = 1;
		// Взятие символа за границей строки возвращает пустую строку
		Пока Сред(СтрокаПроверки, Позиция, 1) = "0" Цикл
			Позиция = Позиция + 1;
		КонецЦикла;
		СтрокаПроверки = Сред(СтрокаПроверки, Позиция);
	КонецЕсли;
	
	// Если содержит только цифры, то в результате замен должна быть получена пустая строка
	// Проверять при помощи ПустаяСтрока нельзя, так как в исходной строке могут быть пробельные символы
	Возврат СтрДлина(
	СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить(
	СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( 
	СтрокаПроверки, "0", ""), "1", ""), "2", ""), "3", ""), "4", ""), "5", ""), "6", ""), "7", ""), "8", ""), "9", ""), ",", "")
	) = 0;
	
КонецФункции

// Преобразование строки вида "01.01.13" или "01.01.2013" к значению типа "дата".
// Возможны друние форматы даты в файле EXCEL.
&НаСервере
Функция ПреобразоватьИзСтрокиВДату(Знач СтрокаДаты)
	Перем ScrptCtrl, OutDate;
	
	Попытка
		ScrptCtrl = Новый COMОбъект("MSScriptControl.ScriptControl");
		ScrptCtrl.Language="vbscript";
		OutDate = ScrptCtrl.Eval("CDate(""" + СтрокаДаты + """)");
		Возврат OutDate;
	Исключение
		//Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат СтрокаДаты;
	
КонецФункции 

// ПОЛУЧЕНИЕ ЗНАЧЕНИЯ ДЛЯ РЕКВИЗИТА ТИПА "ФАЙЛ КАРТИНКИ".

&НаСервере
Функция ПолучитьЗначениеЯчейкиОбластиТабличногоДокументаСКартинками(Знач Область, Знач нСтрока, Знач нКолонка, Знач ПравилоИмяФайлаКартинки = "УИД")
	Перем Рисунок, ит, ИмяФайлаРисунка;
	Перем ЗначениеЯчейки;
	
	ит = 0;
	ЗначениеЯчейки = "";
	Для Каждого Рисунок ИЗ Область.Рисунки Цикл
		ит = ит + 1;
		Если ПравилоИмяФайлаКартинки = "УИД" Тогда
			ИмяФайлаРисунка = КаталогВременныхФайлов() + Новый УникальныйИдентификатор() + ".jpg";
		Иначе
			ИмяФайлаРисунка = КаталогВременныхФайлов() + "С" + нСтрока + "К" + нКолонка + ".jpg";
		КонецЕсли;
		Попытка
			Рисунок.Картинка.Записать(ИмяФайлаРисунка);
			ЗначениеЯчейки = ЗначениеЯчейки + ИмяФайлаРисунка + ?(ит < Область.Рисунки.Количество(), Символы.ПС, "");
		Исключение
			// Поле картинки недоступно для чтения.
		КонецПопытки;
	КонецЦикла;
	
	Возврат ЗначениеЯчейки;
	
КонецФункции



&НаКлиенте
Функция ПереместитьФайлНаСервер(ИмяФайлаДанных)

	Отказ = Ложь;
	Попытка
		Уникальный_Идентификатор = Новый УникальныйИдентификатор;
		ДвоичДанные = Новый ДвоичныеДанные(ИмяФайлаДанных);
		Объект.АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичДанные, Уникальный_Идентификатор); 
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не удалось открыть файл. Проверьте, что он не занят в приложении Excel.'"),,,,Отказ);
	КонецПопытки;
	
	Возврат Отказ;
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ВыполнитьОбработкуНаСервере()
	
	Родитель = Неопределено;
	
	Для Каждого ТекСтрока Из Объект.ЗагружаемыеДанные Цикл
		
		Если ЗначениеЗаполнено(ТекСтрока.Комплектующая) Тогда
			Продолжить;
		КонецЕсли;
				
		Если ТекСтрока.ЭтоГруппа Тогда
			НоваяКомплектующая = Справочники.смартIECHOКомплектующие.СоздатьГруппу();
		Иначе
			НоваяКомплектующая = Справочники.смартIECHOКомплектующие.СоздатьЭлемент();
			НоваяКомплектующая.Цена = ТекСтрока.Цена; 
		КонецЕсли;
		
		НоваяКомплектующая.Наименование = ТекСтрока.НаименованиеИзФайла;
		
		НоваяКомплектующая.Родитель = Родитель;
		
		Если ТекСтрока.ЭтоГруппа Тогда
			НоваяКомплектующая.Родитель = Неопределено;
		КонецЕсли;

		НоваяКомплектующая.Записать();
		
		Если ТекСтрока.ЭтоГруппа Тогда
			Родитель = НоваяКомплектующая.Ссылка;			
		КонецЕсли;
		
		ТекСтрока.Комплектующая = НоваяКомплектующая.Ссылка;
				
	КонецЦикла;
		
КонецПроцедуры
